{
"dialogues2": [
      {
        "id": 1,
        "order": 1,
        "end": "",
        "machine": "",
        "speaker": "Camille",
        "need": [],
        "speech": "Eh bonjour toi, tu as même le temps de passer dire bonjour à une pauvre stressée par ses examens alors que tu es dans ton antre du plaisir.. c'est gentil",
        "choices": [
          {
            "need": [{"key": "Rpapa", "operator": "==", "value": 1}],
            "speech": "Mon vieux m'a montré sa nouvelle trouvaille, une machine ordinateur où il y a ses trucs à lui bizarres d'ingénieurs mais aussi un jeu !",
            "response": "Lui parler de la nouvelle passion de son père, en étant impressionné",
            "nextId": 2,
            "modifiers": []
          },
          {
            "need": [{"key": "Rpapa", "operator": "<", "value": 1}],
            "speech": "Mon père a de nouveau essayé de me convaincre qu'il avait des passions qui pourraient m'intéresser... c'est fou à chaque fois je dois faire un peu semblant sinon il se vexe, moi ce que j'aime c'est être ici avec mes potes c'est tout..",
            "response": "Lui parler de la nouvelle passion de son père, en étant blasé",
            "nextId": 3,
            "modifiers": []
          },
          {
            "need": [],
            "speech": "Fais pas ta demoiselle en détresse perdue dans un endroit inconnu, je sais qu'au fond tu aimes bien être là. Comment ça se passe alors avec tes fiches ?",
            "response": "Lui demander comment vont ses révisions",
            "nextId": 4,
            "modifiers": []
          },
          {
            "need": [{"key": "Reric", "operator": "<", "value": 0}],
            "speech": "Eric commence vraiment à me gonfler, il a toujours besoin de se différencier même dans les jeux, toujours plus intéressants que les nôtres",
            "response": "Se plaindre d'Eric qui se la ramène trop",
            "nextId": 5,
            "modifiers": []
          }
        ]
      },
      {
        "id": 2,
        "order": 2,
        "end": "",
        "machine": "",
        "speaker": "Camille",
        "need": [],
        "speech": "Oh ça fait plaisir de te voir comme ça moi qui croyais que plus rien d'autre que les potes, les bières et les bornes pouvaient allumer de lumière dans tes yeux. Promets-moi que tu m'y emmèneras pour voir, tu sais à quel point la technologie ça m'intéresse !",
        "choices": [
          {
            "need": [],
            "speech": "Tu t'oublies toi dans ta liste des supers choses… Oui allez c'est promis on ira dans la cabane du sorcier !",
            "response": "Lui promettre de l'emmener dans le garage de son père",
            "nextId": 6,
            "modifiers": [{"key": "Rcamille", "operator": "+", "value": 1}]
          },
          {
            "need": [],
            "speech": "Je sais pas trop écoute…Tu sais comme parfois je suis pas encore vraiment à l'aise moi-même avec mes parents ces temps alors t'y emmener…c'est un peu tôt je crois",
            "response": "Botter en touche car gêné de lui faire voir le monde bizarre du papa",
            "nextId": 7,
            "modifiers": [{"key": "Rcamille", "operator": "-", "value": 1}]
          }
        ]
      },
      {
        "id": 3,
        "order": 2,
        "end": "",
        "machine": "",
        "speaker": "Camille",
        "need": [],
        "speech": "Fidèle à toi-même, toujours à trouver tout ennuyeux ou pas assez bien pour toi.. Je te préfère quand tu t'amuses juste sur une borne avec nous là au moins y a de la passion et moins de masque.. m'enfin si moi je te dis que toutes \"ces machines bizarres\" ça peut m'intéresser beaucoup, je me prépare pour aller au Technicum si tu n'as pas oublié..",
        "choices": [
          {
            "need": [],
            "speech": "Non si je te dis que vraiment ça m'intéresse pas et que vraiment je préfère être ici, c'est pas pour recevoir une deuxième leçon de toi, pfff",
            "response": "Lui promettre que c'est pas pour se donner un genre",
            "nextId": 8,
            "modifiers": [{"key": "Rcamille", "operator": "-", "value": 1}]
          },
          {
            "need": [],
            "speech": "Écoute moi c'est pas trop mon truc et tu peux pas m'obliger à m'intéresser mais si tu me dis que toi tu aimerais d'aller causer petite boîte électronique et code avec mon père, c'est autre chose t'as qu'à passer une fois ça serait l'occasion de vous connaître autour de votre super passion de gros cerveaux",
            "response": "Avouer qu'il aimerait bien l'emmener pour lui montrer si elle est intéressée",
            "nextId": 9,
            "modifiers": [{"key": "Rcamille", "operator": "+", "value": 1}]
          }
        ]
      },
      {
        "id": 4,
        "order": 3,
        "end": "",
        "machine": "",
        "speaker": "Camille",
        "need": [],
        "speech": "Ça va, c'est pas encore tout à fait au point mais je suis sûre de pouvoir y arriver, ça serait incroyable pour moi de pouvoir aller au Technicum, malgré ce qu'en pensent mes parents d'ailleurs..",
        "choices": [
          {
            "need": [],
            "speech": "Aller rejoindre sa copine à la table",
            "response": "",
            "nextId": 10,
            "modifiers": []
          }
        ]
      },
      {
        "id": 5,
        "order": 3,
        "end": "",
        "machine": "",
        "speaker": "Camille",
        "need": [],
        "speech": "Je sais comment il est, mais juge-le pas trop, c'est qu'il n'est pas aussi doué que vous sur les autres bornes et donc il trouve son compte ailleurs voilà tout",
        "choices": [
          {
            "need": [],
            "speech": "Mouais",
            "response": "",
            "nextId": 10,
            "modifiers": []
          }
        ]
      },
      {
        "id": 6,
        "order": 4,
        "end": "",
        "machine": "",
        "speaker": "Camille",
        "need": [],
        "speech": "T'es vraiment le meilleur des mecs, j'en ai jamais eu aucun doute !",
        "choices": [
          {
            "need": [],
            "speech": "*rougir*",
            "response": "",
            "nextId": -1,
            "modifiers": [{"key": "Rcamille", "operator": "+", "value": 1}]
          }
        ]
      },
      {
        "id": 7,
        "order": 4,
        "end": "",
        "machine": "",
        "speaker": "Camille",
        "need": [],
        "speech": "C'est bête de se dégonfler comme ça toujours au dernier moment… Je suis plutôt patiente mais pas en surplus d'attention tu as le droit de faire des efforts de temps en temps tu sais…",
        "choices": [
          {
            "need": [],
            "speech": "Je sais… juste là c'est pas le moment",
            "response": "",
            "nextId": -1,
            "modifiers": [{"key": "Rcamille", "operator": "-", "value": 1}]
          }
        ]
      },
      {
        "id": 8,
        "order": 5,
        "end": "",
        "machine": "",
        "speaker": "Camille",
        "need": [],
        "speech": "Bon quand tu es comme ça on ne peut rien faire, je te connais, va te changer les idées avec un stick et des amis qui te comprennent mieux je t'en supplie.",
        "choices": [
          {
            "need": [],
            "speech": "Pffff",
            "response": "",
            "nextId": -1,
            "modifiers": [{"key": "Rcamille", "operator": "-", "value": 1}]
          }
        ]
      },
      {
        "id": 9,
        "order": 5,
        "end": "",
        "machine": "",
        "speaker": "Camille",
        "need": [],
        "speech": "Ah ben tu vois quand tu veux, je vais volontairement ignorer les pointes d'ironie ci et là et accepter avec enthousiasme ton invitation",
        "choices": [
          {
            "need": [],
            "speech": "Salle d'arcade",
            "response": "",
            "nextId": -1,
            "modifiers": [{"key": "Rcamille", "operator": "+", "value": 1}]
          }
        ]
      },
      {
        "id": 10,
        "order": 6,
        "end": "",
        "machine": "",
        "speaker": "Camille",
        "need": [],
        "speech": "Fidèle à toi-même, toujours à trouver tout ennuyeux ou pas assez bien pour toi.. Je te préfère quand tu t'amuses juste sur une borne avec nous là au moins y a de la passion et moins de masque.. m'enfin si moi je te dis que toutes \"ces machines bizarres\" ça peut m'intéresser beaucoup, je me prépare pour aller au Technicum si tu n'as pas oublié..",
        "choices": [
          {
            "need": [],
            "speech": "Non si je te dis que vraiment ça m'intéresse pas et que vraiment je préfère être ici, c'est pas pour recevoir une deuxième leçon de toi, pfff",
            "response": "Lui promettre que c'est pas pour se donner un genre",
            "nextId": -1,
            "modifiers": [{"key": "Rcamille", "operator": "-", "value": 1}]
          },
          {
            "need": [],
            "speech": "Écoute moi c'est pas trop mon truc et tu peux pas m'obliger à m'intéresser mais si tu me dis que toi tu aimerais d'aller causer petite boîte électronique et code avec mon père, c'est autre chose t'as qu'à passer une fois ça serait l'occasion de vous connaître autour de votre super passion de gros cerveaux",
            "response": "Avouer qu'il aimerait bien l'emmener pour lui montrer si elle est intéressée",
            "nextId": -1,
            "modifiers": [{"key": "Rcamille", "operator": "+", "value": 1}]
          }
        ]
      },
      {
      "id": 11,
      "order": 4,
      "end": "",
      "machine": "",
      "speaker": "Eric",
      "need": [],
      "speech": "Eh salut Pierrot, tu viens d'arriver ? regarde ils viennent d'installer cette borne! C'est incroyable on se croirait vraiment dans le film c'est dingue ! Essaie toi même si t'as les 5 balles à mettre pour les 3 crédits.",
      "choices": [
        {
          "need": [{"key": "Reric", "operator": "==", "value": 0}],
          "speech": "Le regarder jouer.",
          "response": "",
          "nextId": 12,
          "modifiers": []
        }
      ]
    },
      {
      "id": 12,
      "order": 5,
      "end": "",
      "machine": ["indiana-jones_station.png","indiana_jones.mp4"],
      "speaker": "Eric",
      "need": [],
      "speech": "Tu vois là tu peux même jouer avec les perspectives, je te jure c'est dingue ça change des jeux tout plats! Et là regarde les animations des ennemis comme c'est bien fait! Et la musique c'est la même que celle du film t'as remarqué! Je te jure j'ai jamais vu ça! Et les autres qui veulent pas décrocher de leur Tetris alala..",
      "choices": [
        {
          "need": [],
          "speech": "Haha quand t'aimes un truc toi on t'arrête pas, mais là je dois bien reconnaître que tu es dans le vrai, ça va être encore plus dur de rentrer chez les vieux",
          "response": "Aimer le jeu",
          "nextId": 13,
          "modifiers": [{"key": "Reric", "operator": "+", "value": 1}]
        },
        {
          "need": [],
          "speech": "Désolé de ne pas partager ton enthousiame mon gars mais moi mon truc c'est pas ces jeux ou tu dois rester des plombes pour avancer, il me faut des trucs plus grisants tu comprends ?",
          "response": "Ne pas aimer le jeu",
          "nextId": 14,
          "modifiers": [{"key": "Reric", "operator": "-", "value": 1}]
        }
      ]
    },
      {
      "id": 13,
      "order": 6,
      "end": "",
      "machine": "",
      "speaker": "Eric",
      "need": [],
      "speech": "Je me trompe jamais c'est comme quand tu es venu voir le film avec moi d'ailleurs, on est vraiment dans une époque cool si les films deviennet ensuite des jeux imagine un jour un jeu Mad Max...",
      "choices": [
        {
          "need": [],
          "speech": "Le rêve...",
          "response": "Salle d'arcade",
          "nextId": -1,
          "modifiers": []
        }
      ]
    },
      {
      "id": 14,
      "order": 6,
      "end": "",
      "machine": "",
      "speaker": "Eric",
      "need": [],
      "speech": "C'est bon j'ai compris tu vas rejoindre les deux autres qui sont bloiqués depuis la construction de ce bar devant la borne Tetris... Tu sais le jeu vidéo ça peut-être autre chose que battre des records et se tier la bourre toute la soirée, au moins Camille est d'accord avec moi sur ça...",
      "choices": [
        {
          "need": [],
          "speech": "Il faut pas le prendre comme ça, pour moi le jeu ça doit juste être du fun tu comprends, sinon je préfère lire ou voir un film...",
          "response": "Salle d'arcade",
          "nextId": -1,
          "modifiers": []
        }
      ]
    },
      {
      "id": 16,
      "order": 7,
      "end": "",
      "machine": "",
      "speaker": "Thomas",
      "need": [],
      "speech": "Salut mec! Regarde le nouveau score de malade que j'ai mis y a dix minutes, aha! ça méritait bien de taper dans l'argent de poche généreusement offert par le daron avocat pour me payer cette savoureuse pinte hehe",
      "choices": [
        {
          "need": [],
          "speech": "[Se rapprocher]",
          "response": "",
          "nextId": 17,
          "modifiers": []
        }
      ]
    },
      {
      "id": 17,
      "order": 8,
      "end": "",
      "machine": "",
      "speaker": "Arnaud",
      "need": [],
      "speech": "Oh ça va c'est le jeu je t'offre ta bière d'accord, mais t'es pas obligé d'en remettre une couche sur mon daron, t'es content de me retrouver ici quand le tien il distribue pas de l'argent mais des cris..",
      "choices": [
        {
          "need": [],
          "speech": "[Les regarder se disputer]",
          "response": "",
          "nextId": 18,
          "modifiers": []
        }
      ]
    },
      {
      "id": 18,
      "order": 9,
      "end": "",
      "machine": "",
      "speaker": "Thomas",
      "need": [],
      "speech": "Va pas sur ce terrain ou je te mets le stick dans le nez...",
      "choices": [
        {
          "need": [],
          "speech": "La vérité c'est que vous êtes les deux aussi ridicules l'un que l'autre ! ça fait des semaines que vous monopolisez cette borne la pauvre elle doit en avoir marre de voir vos tronches.",
          "response": "Se moquer car ils n'arrivent pas à passer à autre chose que ce jeu depuis 2 mois",
          "nextId": 23,
          "modifiers": []
        },
        {
          "need": [],
          "speech": "Toujours à vous foutre sur la gueule vous deux, sinon quoi de neuf ? C'est quoi ce record ?",
          "response": "Leur demander quoi de neuf",
          "nextId": 22,
          "modifiers": []
        },
        {
          "need": [{"key": "Rcamille", "operator": "<", "value": 0}],
          "speech": "Tu sais on s'est de nouveau engueulé avec Camille, je comprends pas trop pourquoi elle prend personnellement des choses qui la concernent pas du tout. Quand je viens là c'est pour me vider la tête pas la remplir de tensions en plus, tu comprends ?",
          "response": "Demander à Arnaud s'il peut lui parler de Camille qui est trop envahissante",
          "nextId": 21,
          "modifiers": []
        }
      ]
    },
      {
      "id": 21,
      "order": 12,
      "end": "",
      "machine": "",
      "speaker": "Arnaud",
      "need": [],
      "speech": "Pierrot je te connais, tu es à chaud mais je crois surtout qu'elle aimerait parfois avoir plus accès à ton univers et ça serait pas si compliqué que tu fasses quelques concessions parfois j'ai l'impression, je me trompe ?",
      "choices": [
        {
          "need": [],
          "speech": "Ouais…t'as peut-être un peu raison, je vais y réfléchir",
          "response": "Accepter qu'il exagère et remercier Arnaud",
          "nextId": 24,
          "modifiers": [
            {"key": "Rarnaud", "operator": "+", "value": 1},
            {"key": "Rcamille", "operator": "+", "value": 1}
          ]
        },
        {
          "need": [],
          "speech": "Ah ben super je cherche du soutien et je me retrouve à un contre deux, c'est de perdre contre Thomas qui te mets dans cette humeur de contradiction",
          "response": "Se vexer et dire que de toute façon il comprend rien",
          "nextId": 25,
          "modifiers": [
            {"key": "Rarnaud", "operator": "-", "value": 1}
          ]
        }
      ]
    },
    {
      "id": 22,
      "order": 13,
      "end": "",
      "machine": "",
      "speaker": "Thomas",
      "need": [],
      "speech": "10580 mon gars, 10580! Faudra se lever tôt pour l'effacer celui-ci hehe. T'aurais du voir sa tête à Arnaud aussi rouge que quand une fille le regarde haha..",
      "choices": [
        {
          "need": [],
          "speech": "[Se retourner vers Arnaud]",
          "response": "",
          "nextId": 26,
          "modifiers": []
        }
      ]
    },
    {
      "id": 23,
      "order": 14,
      "end": "",
      "machine": "",
      "speaker": "Arnaud",
      "need": [],
      "speech": "On t'emmerde Pierrot va plutôt te chercher une mousse, j'ai déjà un vieux pour les leçons de morale... Bon d'ailleurs t'as vu la nouvelle de la machine de salon qui débarque bientôt ? C'est dans le magazine là.",
      "choices": [
        {
          "need": [],
          "speech": "Quoi ? Dis en plus pour moi le salon c'était définitivement fini pour les jeux! déjà toute à l'heure mon daron à essayer de me monter qu'on pouvait s'amuser sur un ordinateur, tu imagines un ordinateur avec l'écrant en noir et blanc qui affiche des chiffres et des lettres?!",
          "response": "Demander ce que c'est cette nouvelle machine",
          "nextId": 29,
          "modifiers": []
        },
        {
          "need": [],
          "speech": "Oh moi vos trucs de connaisseurs là j'ai de la peine, je m'y intéresserais si c'est vraiment bien quand ça sera arrivé ici. Dans ces magazines il y a toujours tout qui fait super envie et au final on revient toujours ici..",
          "response": "N'est pas intéressé par ça, préfère aller voir ailleurs",
          "nextId": 30,
          "modifiers": []
        }
      ]
    },
    {
      "id": 24,
      "order": 15,
      "end": "",
      "machine": "",
      "speaker": "Arnaud",
      "need": [],
      "speech": "Allez courage, on va plutôt aller boire un coup et perdre deux trois pièces maintenant.",
      "choices": [
        {
          "need": [],
          "speech": "Partant!",
          "response": "Salle d'arcade",
          "nextId": 28,
          "modifiers": []
        }
      ]
    },
    {
      "id": 25,
      "order": 16,
      "end": "",
      "machine": "",
      "speaker": "Arnaud",
      "need": [],
      "speech": "Oui ça doit être ça, ça doit être ça… va plutôt chercher un coup à boire va ça te changera les idées",
      "choices": [
        {
          "need": [],
          "speech": "Ciao",
          "response": "Salle d'arcade",
          "nextId": 28,
          "modifiers": []
        }
      ]
    },
    {
      "id": 26,
      "order": 17,
      "end": "",
      "machine": "",
      "speaker": "Arnaud",
      "need": [],
      "speech": "Ouais c'est bon ferme là, regarde plutôt ça Pierrot, ça vient de sortir dans le magazine une nouvelle console de salon pour enfin peut-être faire oublier le désastre Atari, incroyable non ?",
      "choices": [
        {
          "need": [],
          "speech": "Quoi ? Dis en plus pour moi le salon c'était définitivement fini pour les jeux! déjà toute à l'heure mon daron à essayer de me montrer qu'on pouvait s'amuser sur un ordinateur, tu imagines un ordinateur avec l'écran en noir et blanc qui affiche des chiffres et des lettres?!",
          "response": "Demander ce que c'est cette nouvelle machine",
          "nextId": 29,
          "modifiers": [
            {"key": "Rconsole", "operator": "+", "value": 1}
          ]
        },
        {
          "need": [],
          "speech": "Oh moi vos trucs de connaisseurs là j'ai de la peine, je m'y intéresserai si c'est vraiment bien quand ça sera arrivé ici. Dans ces magazines il y a toujours tout qui fait super envie et au final on revient toujours ici..",
          "response": "N'est pas intéressé par ça, préfère aller voir ailleurs",
          "nextId": 30,
          "modifiers": [
            {"key": "Rconsole", "operator": "-", "value": 1}
          ]
        }
      ]
    },
    {
      "id": 27,
      "order": 18,
      "end": "",
      "machine": "",
      "speaker": "Arnaud",
      "need": [],
      "speech": "Ouais c'est bon ferme là, regarde plutôt ça Pierrot, ça vient de sortir dans le magazine une nouvelle console de salon pour enfin peut-être faire oublier le désastre Atari, incroyable non ?",
      "choices": [
        {
          "need": [],
          "speech": "Quoi ? Dis en plus pour moi le salon c'était définitivement fini pour les jeux! déjà toute à l'heure mon daron à essayer de me montrer qu'on pouvait s'amuser sur un ordinateur, tu imagines un ordinateur avec l'écran en noir et blanc qui affiche des chiffres et des lettres?!",
          "response": "Demander ce que c'est cette nouvelle machine",
          "nextId": 29,
          "modifiers": [
            {"key": "Rconsole", "operator": "+", "value": 1}
          ]
        },
        {
          "need": [],
          "speech": "Oh moi vos trucs de connaisseurs là j'ai de la peine, je m'y intéresserai si c'est vraiment bien quand ça sera arrivé ici. Dans ces magazines il y a toujours tout qui fait super envie et au final on revient toujours ici..",
          "response": "N'est pas intéressé par ça, préfère aller voir ailleurs",
          "nextId": 30,
          "modifiers": [
            {"key": "Rconsole", "operator": "-", "value": 1}
          ]
        }
      ]
    },
    {
      "id": 28,
      "order": 19,
      "end": "",
      "machine": "",
      "speaker": "",
      "need": [],
      "speech": "",
      "choices": []
    },
    {
      "id": 29,
      "order": 20,
      "end": "",
      "machine": "",
      "speaker": "Arnaud",
      "need": [],
      "speech": "C'est complètement fou apparemment ça pourrait faire oublier le four de l'Atari, la machine permet d'afficher carrément des meilleures couleurs et plus de pixels et y aurait directement des jeux faits par les mêmes que ceux qui lancent la console, le Nintendo là. T'imagines avoir comme ici mais dans ton salon direct plus besoin de payer cent sous pour chaque partie ça serait infini !",
      "choices": [
        {
          "need": [],
          "speech": "Merci pour l'info, on va suivre ça de près c'est sûr!",
          "response": "Salle d'arcade",
          "nextId": -1,
          "modifiers": []
        }
      ]
    },
    {
      "id": 30,
      "order": 21,
      "end": "",
      "machine": "",
      "speaker": "Arnaud",
      "need": [],
      "speech": "C'est pour plaire à Camille que tu te donnes ce genre mec blasé de tout ? Pourtant à chaque fois tu reviens ici c'est qu'on doit pas être si nazes...",
      "choices": [
        {
          "need": [],
          "speech": "ça doit être ça ouais.",
          "response": "Salle d'arcade",
          "nextId": -1,
          "modifiers": []
        }
      ]
    },
  {
    "id": 31,
    "order": 1,
    "end": "",
    "machine": "",
    "speaker": "Papa",
    "need": [],
    "speech": "Alors ça regarde c’est une machine qui en jette ! Je l’ai achetée dans la boutique spécialisée d’électroniques en ville, regarde ça, jte jure c’est vraiment une pépite de technologie, viens seulement tu peux le prendre.",
    "choices": [
      {
        "need": [],
        "speech": "C’est quoi ce truc bizarre ? Comment ça peut afficher quelque chose ?",
        "response": "Questionner l’utilité de la machine",
        "nextId": 32,
        "modifiers": []
      },
      {
        "need": [],
        "speech": "Ouaaah c’est marrant comme truc, et après ça sert à quoi ?",
        "response": "S’intéresser à l’utilité de la machine",
        "nextId": 33,
        "modifiers": []
      }
    ]
  },
  {
    "id": 32,
    "order": 2,
    "end": "",
    "machine": "",
    "speaker": "Papa",
    "need": [],
    "speech": "Alors tu vois c’est une machine qui permet de faire plusieurs choses, mais il faut évidemment la connecter à un écran j’allais justement le faire ! Tu peux par exemple jouer, ça doit sûrement te faire un peu plus sourire, mais aussi la faire calculer pour toi ou composer des documents comme une machine à écrire, mais pas besoin de papier !",
    "choices": [
      {
        "need": [],
        "speech": "Jouer ? Avec un truc comme ça c’est des jeux bizarres ou de vieux, jamais ça ne peut rivaliser avec les bornes. Écoute papa mes amis m’attendent !",
        "response": "Se montrer sceptique et pressé",
        "nextId": 34,
        "modifiers": [{"key": "Rpapa", "operator": "-", "value": 1}]
      },
      {
        "need": [],
        "speech": "Bon comme d’habitude il est beaucoup trop enthousiaste pour un de ses nouveaux joujoux, mais ça va lui faire plaisir si je m’intéresse un peu. Bon, montre-moi 2-3 trucs que tu peux faire avec ton truc.",
        "response": "Faire semblant d’être intéressé",
        "nextId": 35,
        "modifiers": [{"key": "Rpapa", "operator": "+", "value": 1}]
      }
    ]
  },
  {
    "id": 33,
    "order": 2,
    "end": "",
    "machine": "",
    "speaker": "Papa",
    "need": [],
    "speech": "Pleins de choses ! D’abord, tu peux écrire en éditant directement sur l’écran donc la machine à écrire ne va pas tenir longtemps la comparaison! Tu peux faire de la programmation bien sûr pour utiliser la logique de la machine pour qu’elle fasse des calculs à ta place et le meilleur enfin: tu peux jouer ! tu veux que je te montre ?",
    "choices": [
      {
        "need": [],
        "speech": "Oui avec plaisir tu peux jouer à quoi par exemple ? C’est comme la station au bar ?",
        "response": "S’intéresser aux jeux",
        "nextId": 36,
        "modifiers": [{"key": "Rpapa", "operator": "+", "value": 1}]
      },
      {
        "need": [],
        "speech": "Tu me montreras la prochaine fois là mes potes m’attendent, je suis déjà en retard !",
        "response": "Refuser gentiment pour partir",
        "nextId": 37,
        "modifiers": [{"key": "Rpapa", "operator": "-", "value": 1}]
      }
    ]
  },
  {
    "id": 34,
    "order": 3,
    "end": "",
    "machine": "",
    "speaker": "Papa",
    "need": [],
    "speech": "Comme tu veux, mais tu sais parfois pour moi ça serait important que tu t’intéresses un peu à des choses que je te montre, je crois que je peux encore t’apprendre 2-3 choses…",
    "choices": [
      {
        "need": [],
        "speech": "Bye",
        "response": "level1",
        "nextId": -10,
        "modifiers": []
      }
    ]
  },
  {
    "id": 35,
    "order": 3,
    "end": "",
    "machine": ["appleII.png","space_invaders.mp4"],
    "speaker": "Papa",
    "need": [],
    "speech": "Eh beh, l’enthousiasme peut aller se faire voir, mais regarde je vais te faire changer d’avis !",
    "choices": [
      {
        "need": [],
        "speech": "Allez !",
        "response": "voir la démo",
        "nextId": 38,
        "modifiers": []
      }
    ]
  },
  {
    "id": 36,
    "order": 3,
    "end": "",
    "machine": ["appleII.png","space_invaders.mp4"],
    "speaker": "Papa",
    "need": [],
    "speech": "Ah non, là les capacités de l’écran réduisent évidemment les possibilités, mais par contre il suffit de descendre au garage et tu as pas besoin d’utiliser mon argent de poche pour payer ta partie, allez regarde !",
    "choices": [
      {
      "need": [],
      "speech": "Allez !",
      "response": "voir la démo",
      "nextId": 38,
      "modifiers": []
    }]
  },
  {
    "id": 37,
    "order": 3,
    "end": "",
    "machine": "",
    "speaker": "Papa",
    "need": [],
    "speech": "Aah les ados c’est toujours comme ça, jamais 10min pour se poser avec ses parents, mais pour les potes faut être là à la minute!",
    "choices": [
      {
        "need": [],
        "speech": "Bye",
        "response": "level1",
        "nextId": -10,
        "modifiers": []
      }
    ]
  },
  {
    "id": 38,
    "order": 1,
    "end": "",
    "machine": ["appleII.png","space_invaders.mp4"],
    "speaker": "Papa",
    "need": [],
    "speech": "Regarde cette bête elle a pas la puissance de son successeur sorti le mois dernier, mais quand même 64kilos octets de mémoire enfermée dans une petite boîte comme ça c’est un petit miracle ! D’abord il faut insérer cette petite disquette juste ici et faire 2-3 manips, mais rien de sorcier et tadaaaam regarde ça !",
    "choices": [
      {
        "need": [],
        "speech": "Attends, c’est quoi la machine qui est sortie ? C’est pas ton caprice dont parle toujours maman ces derniers temps ? Je ne crois pas qu’elle partage ton amour des hocktey-trucs..",
        "response": "Questionner la nouvelle machine et la réaction de maman",
        "nextId": 39,
        "modifiers": []
      },
      {
        "need": [],
        "speech": "Cool ! Mais tu m’as dit que tu peux jouer ?! Moi je croyais que c’était juste pour faire tes codes bizarres, tu me fais toujours des commentaires comme quoi il faut faire attention aux jeux quand je vais à la salle.",
        "response": "S’étonner qu’on puisse jouer dessus",
        "nextId": 40,
        "modifiers": []
      },
      {
        "need": [],
        "speech": "Bon c’est bien gentil tout ça mais moi j’vais rejoindre mes potes je suis déjà en retard en fait..",
        "response": "S’excuser pour partir",
        "nextId": 41,
        "modifiers": []
      }
    ]
  },
  {
    "id": 39,
    "order": 2,
    "end": "",
    "machine": ["appleII.png","space_invaders.mp4"],
    "speaker": "Papa",
    "need": [],
    "speech": "Aaah oui ça… tu vois ce petit jeu-là, c’est rien de sorcier, mais moi ça me détend comme certains ont besoin de leur émission à la télévision !.. Écoute ta mère à parfois de la peine à saisir ce que cette passion représente pour moi. Je suis toute la journée en train de bosser avec des câbles et ma boîte à outils c’est toute ma vie que je ne connais bien que ce domaine ! Alors quand je peux me changer les idées ici j’ai besoin de toucher à l’électro, mais des idées neuves quoi sinon je m’enfermerais dans ma routine du boulot et je perdrais la passion pour tout ça, je serais déjà fou ! Je demande pas qu’elle frappe des lignes en BASIC, mais juste qu’elle tolère pourquoi je disparais ici, et pourquoi mettre la main sur le MACHINTOSH passe pour moi avant acheter une nouvelle voiture…",
    "choices": [
      {
        "need": [],
        "speech": "Ouais je vois, eh c’est pas souvent que tu me dis tout ça, les machines on le pouvoir de te faire débiter plus on dirait. Mais là j’entends Maman qui rentre je file sinon elle va encore me demander de nettoyer ma chambre ou je ne sais pas quoi.. TU me laisseras essayer ton jeu pour technicien la prochaine fois!",
        "response": "Montrer de l’intérêt et filer avant que maman arrive",
        "nextId": 42,
        "modifiers": []
      }
    ]
  },
  {
    "id": 40,
    "order": 2,
    "end": "",
    "machine": ["appleII.png","space_invaders.mp4"],
    "speaker": "Papa",
    "need": [],
    "speech": "Non regarde je te lance un bon jeu : Apple invaders, c’est une reprise de space invaders tu sais je crois que tu as connu quand à la salle ils l’avaient encore.. C’est une version ou tu peux aussi te faire tirer dessus, je crois, mais je suis pas très doué il faut dire que j’ai toujours plus étà un technicien qu’un gars qui aimait aller sur les terrains peut-être c’est pour ça je fais même pas de foot. Mais je t’encourage pour l’équipe de l’école on se revoit vite là-dessus !",
    "choices": [
      {
        "need": [],
        "speech": "Space Invaders, ah mais ça je connais bien, et que j’ai presque tout le temps fait un record, je me demande si tu peux m’impressionner avec ta version maison! Je te crois pas vraiment mais vas-y montre !",
        "response": "Montrer de l'intérêt et comparer avec la borne d'arcade",
        "nextId": 43,
        "modifiers": []
      },
      {
        "need": [],
        "speech": "Bon d'accord mais je dois partir juste après, mes potes m'attendent à la salle d'arcade pour faire quelques parties de Donkey Kong. La version maison a l'air bien mais rien ne vaut l'original!",
        "response": "Accepter de jouer mais rester sceptique",
        "nextId": 44,
        "modifiers": [
        ]
      }
    ]
  },
  {
    "id": 41,
    "order": 2,
    "end": "",
    "machine": "",
    "speaker": "Papa",
    "need": [],
    "speech": "Ahh, tu as raison, file avant que ta mère te tombe dessus! Je te montrerai tout ça une autre fois, promets-moi juste de prendre un peu de temps pour ça la prochaine fois.",
    "choices": [
      {
        "need": [],
        "speech": "Bye",
        "response": "level1",
        "nextId": -10,
        "modifiers": [{"key": "Rpapa", "operator": "+", "value": 1}]
      }
    ]
  },
  {
    "id": 42,
    "order": 3,
    "end": "",
    "machine": ["appleII.png","space_invaders.mp4"],
    "speaker": "Papa",
    "need": [],
    "speech": "Héhé, d'accord, file avant que ça chauffe. La prochaine fois, c'est toi qui prends les commandes!",
    "choices": [
      {
        "need": [],
        "speech": "Bye",
        "response": "level1",
        "nextId": -10,
        "modifiers": [{"key": "Rpapa", "operator": "+", "value": 1}]
      }
    ]
  },
  {
    "id": 43,
    "order": 3,
    "end": "",
    "machine": ["appleII.png","space_invaders.mp4"],
    "speaker": "Papa",
    "need": [],
    "speech": "Ah tu vas voir, même la version maison peut te surprendre! Installe-toi et prépare-toi à défendre la Terre contre les envahisseurs!",
    "choices": [
      {
        "need": [],
        "speech": "Bye",
        "response": "level1",
        "nextId": -10,
        "modifiers": []
      }
    ]
  },
  {
    "id": 44,
    "order": 3,
    "end": "level1",
    "machine": ["appleII.png","space_invaders.mp4"],
    "speaker": "Papa",
    "need": [],
    "speech": "Je comprends, rien ne vaut une bonne partie entre potes. Passe un bon moment et on verra si cette version peut te convaincre une autre fois.",
    "choices": [
      {
      "need": [],
      "speech": "Bye",
      "response": "level1",
      "nextId": -10,
      "modifiers": []
    }
    ]
  },



    {
        "id": 998,
        "order": 2,
        "end": "",
        "machine": "",
        "speaker": "Camille",
        "need": [],
        "speech": "Merci énormément c'est exactemetn le genre de pages que je collectionne, je suis touchée que tu aies pensé à moi.",
        "choices": [
          {
            "need": [],
            "speech": "Parler d'autre chose",
            "response": "Lui promettre de l'emmener dans le garage de son père",
            "nextId": 1,
            "modifiers": [{"key": "Rcamille", "operator": "+", "value": 1}]
          }
        ]
      }
    ],
  "objets": [
    {
      "id": 999,
      "order": 1,
      "end": "",
      "machine": "",
      "img": "construire.png",
      "speaker": "np_construire",
      "need": [],
      "speech": "«Il y a un moment où tu ne penses plus tout à fait à ce que tu es en train de faire, bien que tu sentes que tu as une parfaite maîtrise de l’histoire. Tant que tu arrives à maintenir cet état, tu es au meilleur niveau. Tu es en phase avec la machine. Ce moment est fascinant. Cette extase devient un but en soi, et tu essaies de retrouver ce moment-là. » ",
      "choices": [
        {
          "need": [],
          "remember": true,
          "speech": "Très bonne phrase je la note tiens.",
          "nextId": -1
        }
      ]
    },
    {
      "id": 998,
      "order": 1,
      "end": "",
      "machine": "",
      "img": "appleII_mag.jpg",
      "speaker": "np_appleII",
      "need": [],
      "speech": "«L'Apple II n'a pas été conçu comme un produit ordinaire. Il utilisait partout des astuces farfelues.»",
      "choices": [
        {
          "need": [],
          "remember": true,
          "speech": "Très bonne phrase je la note tiens.",
          "nextId": -1
        }
      ]
    }
  ]
}



